Revit 2024 API
AssetPropertyInteger Class
 Represents a property of material.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class AssetPropertyInteger : AssetProperty
Visual Basic
Public Class AssetPropertyInteger _
	Inherits AssetProperty
Visual C++
public ref class AssetPropertyInteger : public AssetProperty
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyInteger
See Also
AssetPropertyInteger Members
Autodesk.Revit.DB.Visual Namespace